Ran Plan for 4 projects:

1. dir: `SQS/SQS-3D-File` workspace: `default`
1. dir: `SQS/SQS-Document` workspace: `default`
1. dir: `SQS/SQS-Picture` workspace: `default`
1. dir: `SQS/SQS-Video` workspace: `default`
---

### 1. dir: `SQS/SQS-3D-File` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_sqs_queue.sqs_3d_file will be created
+ resource "aws_sqs_queue" "sqs_3d_file" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "sqs-3d-file"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-3d-file"
          + "environment" = "development"
          + "name"        = "sqs-3d-file"
        }
      + tags_all                          = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-3d-file"
          + "environment" = "development"
          + "name"        = "sqs-3d-file"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ sqs_queue_arn  = (known after apply)
+ sqs_queue_name = "sqs-3d-file"
+ sqs_queue_url  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d SQS/SQS-3D-File
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FSQS%252FSQS-3D-File%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d SQS/SQS-3D-File
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `SQS/SQS-Document` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_sqs_queue.sqs_document will be created
+ resource "aws_sqs_queue" "sqs_document" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "sqs-document"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-document"
          + "environment" = "development"
          + "name"        = "sqs-document"
        }
      + tags_all                          = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-document"
          + "environment" = "development"
          + "name"        = "sqs-document"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ sqs_queue_arn  = (known after apply)
+ sqs_queue_name = "sqs-document"
+ sqs_queue_url  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d SQS/SQS-Document
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FSQS%252FSQS-Document%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d SQS/SQS-Document
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 3. dir: `SQS/SQS-Picture` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_sqs_queue.sqs_picture will be created
+ resource "aws_sqs_queue" "sqs_picture" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "sqs-picture"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-picture"
          + "environment" = "development"
          + "name"        = "sqs-picture"
        }
      + tags_all                          = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-picture"
          + "environment" = "development"
          + "name"        = "sqs-picture"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ sqs_queue_arn  = (known after apply)
+ sqs_queue_name = "sqs-picture"
+ sqs_queue_url  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d SQS/SQS-Picture
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FSQS%252FSQS-Picture%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d SQS/SQS-Picture
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 4. dir: `SQS/SQS-Video` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_sqs_queue.sqs_video will be created
+ resource "aws_sqs_queue" "sqs_video" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "sqs-video"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-video"
          + "environment" = "development"
          + "name"        = "sqs-video"
        }
      + tags_all                          = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/sqs/sqs-video"
          + "environment" = "development"
          + "name"        = "sqs-video"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ sqs_queue_arn  = (known after apply)
+ sqs_queue_name = "sqs-video"
+ sqs_queue_url  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d SQS/SQS-Video
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FSQS%252FSQS-Video%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d SQS/SQS-Video
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### Plan Summary

4 projects, 4 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```